# Manage symlinks for dotfiles
brew "stow"

# Super fast replacement for Ack
brew "ripgrep"

# Ruby build dependencies
brew "openssl"
brew "libyaml"

# Our own zsh
brew "zsh"

# Our own bash (bits like tmux-extrakto require modern versions)
brew "bash"

# General purpose fuzzy finder
brew "fzf"

# Nice cheats for unix commands (like man but without the noise)
brew "cheat"

# Use our own git
brew "git"
brew "git-gui"

# Use our own ctags
brew "ctags"

# Terminal multiplexer
brew "tmux"

# ...to rule them all
brew "neovim"

# Gnu tree to display directory structures
brew "tree"

# AWS command line tools
brew "awscli"

# Wrapper to allow supporting .inputrc settings on bad repls like <iex>
brew "rlwrap"

# Grep-like json processor
brew "jq"

# GNU core utilities
brew "coreutils"

# Text to UML (flow, class and other diagrams)
brew "plantuml"

# Cat like viewer with syntax highlighting, git support and other goodies
brew "bat"

# Fancy ascii header generator
brew "figlet"

# Simple interface for inotify (watch files and run commands)
brew "entr"

# Transform json into stream of flat lines, easier to grep
brew "gron"

# Generic version manager
brew "rtx"

# UI framework required for erlang observer, debugger, etc
brew "wxwidgets"

# Extra unix tools, like vidir
brew "moreutils"

# Github command line tooling
brew "gh"

# More convinient than curl
brew "wget"

# Lua language server, mostly for NeoVim
brew "lua-language-server"

# Nice looking monospaced font
tap homebrew/cask-fonts
brew "font-iosevka"

# Auto text-expansion
brew "espanso"

# Terminal of choice
brew "alacritty""
