# manage symlinks for dotfiles
brew "stow"

# super fast replacement for Ack
brew "ripgrep"

# ruby build dependencies
brew "openssl"
brew "libyaml"

# zsh and plugin manager
brew "zsh"
brew "zplug"

# better diff formatting
brew "diff-so-fancy"

# general purpose fuzzy finder
brew "fzf"

# nice cheats for unix commands (like man but without the noise)
brew "cheat"

# use our own python
brew "python"

# use our own git
brew "git"

# use our own ctags
brew "ctags"

# terminal multiplexer
brew "tmux"

# ...to rule them all
brew "macvim", args: ['override-system-vim']

# gnu tree to display directory structures
brew "tree"

# move files to trash instead of deleting them
brew "trash"

# github tooling
brew "hub"

# AWS command line tools
brew "awscli"

# You want to edit those docx files with Vim right?
# it may require BasicTeX (https://www.tug.org/mactex/morepackages.html)
brew "pandoc"

# Wrapper to allow supporting .inputrc settings on bad repls like <iex>
brew "rlwrap"

# cute http command line client
brew "httpie"

# grep-like json processor
brew "jq"

# GNU core utilities
brew "coreutils"

# Text to UML (flow, class and other diagrams)
brew "plantuml"

# Cat like viewer with syntax highlighting, git support and other goodies
brew "bat"

# Taskwarrior - task manager
brew "task"
