tap "homebrew/cask-fonts"

# Manage symlinks for dotfiles
brew "stow"

# Super fast replacement for Ack
brew "ripgrep"

# Ruby build dependencies
brew "openssl"
brew "libyaml"

# Our own zsh
brew "zsh"

# Our own bash (bits like tmux-extrakto require modern versions)
brew "bash"

# General purpose fuzzy finder
brew "fzf"

# Nice cheats for unix commands (like man but without the noise)
brew "cheat"

# Use our own git
brew "git"
brew "git-gui"
brew "git-absorb"

# Use our own ctags
brew "ctags"

# Terminal multiplexer
brew "tmux"

# ...to rule them all
brew "neovim"

# Gnu tree to display directory structures
brew "tree"

# AWS command line tools
brew "awscli"

# AWS command line tools
cask "google-cloud-sdk"

# Grep-like json processor
brew "jq"

# GNU core utilities
brew "coreutils"

# Cat like viewer with syntax highlighting, git support and other goodies
brew "bat"

# Fancy ascii header generator
brew "figlet"

# Simple interface for inotify (watch files and run commands)
brew "entr"

# Transform json into stream of flat lines, easier to grep
brew "gron"

# Generic version manager
brew "mise"

# UI framework required for erlang observer, debugger, etc
brew "wxwidgets"

# Github command line tooling
brew "gh"

# More convinient than curl
brew "wget"

# Lua language server, mostly for NeoVim
brew "lua-language-server"

# Nice looking monospaced font
cask "font-iosevka"

# Auto text-expansion
cask "espanso"

# Terminal of choice
cask "alacritty"

# Required to install things like fzf
brew "cmake"

# Used for test automation, PDF generation, etc.
cask "chromium"

# Use GNU version of cal
brew "gcal"

# Used to format MD files, conversion to/from docx, etc.
brew "pandoc"
